app/controllers/movies_controller.rb

  def index
    @movies = Movie.all
  	session[:p] = params[:p] if params[:p]
  	session[:ratings] = params[:ratings] if params[:ratings]
  	if session[:p]
  	  if session[:p] == 'title'
  		  @movies = Movie.order :title
  	  else session[:p] == 'date'
        @movies = Movie.order :release_date
      end
    end


    if session[:ratings]
    	@movies = @movies.select {|e| session[:ratings].include? e.rating}
---
SELECT "movies".* FROM "movies" ORDER BY release_date
SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G')

  def title_sort
    @movies = Movie.order :title
---
SELECT "movies".* FROM "movies" ORDER BY title

  def date_sort
  	@movies = Movie.order :release_date
---
SELECT "movies".* FROM "movies" ORDER BY release_date